Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ) Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроисхождениеНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПроисхождениеНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступленияОсновногоСредства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВводаВЭксплуатацию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TrId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДавальческогоСырья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДавальческогоСырья</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестонахождениеОСДляГНИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестоНахождениеОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАктиваДляЗачетаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктиваДляЗачетаНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретенныеОсновныеСредства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретенныеНематериальныеАктивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериалыНаПереработку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	
	ВидНоменклатуры=Объект.ВидНоменклатуры;
	
	Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		СчетаУчета=ПолучитьСписокСчетовУчета(ВидНоменклатуры);
	Иначе
		Объект.СчетУчетаБУ="";
		Возврат;
	КонецЕсли;	          
	
	Элементы.СчетУчетаБУ.СписокВыбора.Очистить();
	
	Для Каждого СчетУчета Из СчетаУчета Цикл
		Элементы.СчетУчетаБУ.СписокВыбора.Добавить(СчетУчета.Значение,СчетУчета.Представление);
	КонецЦикла;	
	
	Если Элементы.СчетУчетаБУ.СписокВыбора.НайтиПоЗначению(Объект.СчетУчетаБУ)=Неопределено Тогда
		Объект.СчетУчетаБУ="";
	Иначе
		Элементы.СчетУчетаБУ.ВыделенныйТекст=Элементы.СчетУчетаБУ.СписокВыбора.НайтиПоЗначению(Объект.СчетУчетаБУ).Представление;	
	КонецЕсли;	
	
	Если СчетаУчета.Количество()=1 Тогда
		Если Объект.СчетУчетаБУ<>СчетаУчета[0].Значение Тогда
			Объект.СчетУчетаБУ=СчетаУчета[0].Значение;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокСчетовУчета(ВидНоменклатуры)

	
	СчетГруппа=ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	СчетУчета=ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	
	Если НЕ ВидНоменклатуры.Пустая() Тогда
		
		Если ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Материалы Тогда
			
			СчетГруппа = ПланыСчетов.Хозрасчетный.А1000;
		
		ИначеЕсли ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Оборудование Тогда
			
			СчетГруппа = ПланыСчетов.Хозрасчетный.А0700;
			
		ИначеЕсли ВидНоменклатуры=Перечисления.ВидыНоменклатуры.ПриобретенныеОсновныеСредства Тогда
			
			СчетУчета = ПланыСчетов.Хозрасчетный.А0820;
			
		ИначеЕсли ВидНоменклатуры=Перечисления.ВидыНоменклатуры.ПриобретенныеНематериальныеАктивы Тогда
			
			СчетУчета = ПланыСчетов.Хозрасчетный.А0830;
			
		//ИначеЕсли ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Полуфабрикаты Тогда
		//	
		//	СчетГруппа = ПланыСчетов.Хозрасчетный.А2100;
			
		КонецЕсли; 
		
	КонецЕсли; 	
	
	
	СписокСчетов=Новый СписокЗначений;

	Если ЗначениеЗаполнено(СчетУчета) Тогда
		
		СписокСчетов.Добавить(СчетУчета.Ссылка,СчетУчета.Код+" ("+СчетУчета.Наименование+")");
		Возврат СписокСчетов;
		
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет,
	|	Хозрасчетный.Код КАК Код,
	|	Хозрасчетный.Наименование КАК Наименование
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|
	|ГДЕ
	|	(Хозрасчетный.Ссылка В ИЕРАРХИИ(&Счет))
	|  И
	|	(НЕ(Хозрасчетный.Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ 	СчетРодитель.Родитель ИЗ ПланСчетов.Хозрасчетный КАК СчетРодитель ГДЕ 	НЕ(СчетРодитель.Родитель = НЕОПРЕДЕЛЕНО) ))) 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	Запрос.УстановитьПараметр("Счет",СчетГруппа);
	Результат=Запрос.Выполнить().Выбрать();
	
	
	Пока Результат.Следующий() Цикл
		СписокСчетов.Добавить(Результат.Счет,Результат.Код+" ("+Результат.Наименование+")");
	КонецЦикла;
	
	Возврат СписокСчетов;

КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		//ВидНоменклатурыПриИзменении("");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидНоменклатуры=Объект.ВидНоменклатуры;
	
	Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		СчетаУчета=ПолучитьСписокСчетовУчета(ВидНоменклатуры);
		Для Каждого СчетУчета Из СчетаУчета Цикл
			Элементы.СчетУчетаБУ.СписокВыбора.Добавить(СчетУчета.Значение,СчетУчета.Представление);
		КонецЦикла;	
	КонецЕсли;	          
	
КонецПроцедуры
